let badWords = [
  "چس",
  "گوز",
  "ان",
  "لجن",
  "کثافت",
  "بی شرف",
  "بیشعور",
  "گوه",
  "کون",
  "کیری",
  "کسکش",
  "بی ناموس",
  "سگ پدر",
  "پدرسگ",
  "شاش",
  "ریدن",
  "ریدی",
  "کونی",
  "دیوس",
  "انی",
  "گهی",
  "بی پدر",
  "مادرسگ",
  "بی ناموس",
  "جنده",
  "گایدی",
  "گایدن",
  "کیر",
  "کیروکس",
  "عمتو",
  "خفه شو",
  "خفه",
  "خفه خون",
  "مرض داری",
  "مرضداری",
  "گردن دراز",
  "خری",
  "گاوی",
  "اسبی",
  "سگی",
  "حیوانی",
  "دهنتوببند",
  "انگل",
  "آشغال",
  "خرفت",
  "پپه",
  "خنگ",
  "دکل",
  "دله",
  "قرتی",
  "گوزو",
  "کونده",
  "کون ده",
  "گاگول",
  "ابله",
  "گنده گوز",
  // "کس",
  "کله کیری",
  "گشاد",
  "دخترقرتی",
  "خواهرجنده",
  "مادرجنده",
  "لخت",
  "بخورش",
  "بپرسرش",
  "بپرروش",
  "بیابخورش",
  "میخوریش",
  "بمال",
  "دیوس خان",
  "زرنزن",
  "زنشو",
  "زنتو",
  "زن جنده",
  "بکنمت",
  "بکن",
  "بکن توش",
  "بکنش",
  "لز",
  "سکس",
  "سکسی",
  "ساک",
  "ساک بزن",
  "پورن",
  "سکسیی",
  "کونن",
  "کیرر",
  "جاکش",
  "انی",
  "بدبخت",
  "خایه",
  "خایه مال",
  "خایه خور",
  "ممه",
  "ممه خور",
  "دخترجنده",
  "خارکسده",
  "کس ننت",
  "کیردوس",
  "مادرکونی",
  "خارکسده",
  "خارکس ده",
  "کیروکس",
  "کس و کیر",
  "زنا",
  "زنازاده",
  "ولدزنا",
  "ملنگ",
  "سادیسمی",
  "فاحشه",
  "خانم جنده",
  "فاحشه خانم",
  "سیکتیر",
  "سسکی",
  "کس خیس",
  "حشری",
  "گاییدن",
  "بکارت",
  "داف",
  "بچه کونی",
  "کسشعر",
  "سرکیر",
  "سوراخ کون",
  "حشری شدن",
  "کس کردن",
  "کس دادن",
  "بکن بکن",
  "شق کردن",
  "کس لیسیدن",
  "آب کیر",
  "جاکش",
  "جلق زدن",
  "جنده خانه",
  "شهوتی",
  "عن",
  "قس",
  "کردن",
  "کردنی",
  "کس لیس",
  "کس کش",
  "کوس",
  "کیرمکیدن",
  "لاکونی",
  "پستان",
  "آلت",
  "آلت تناسلی",
  "نرکده",
  "مالوندن",
  "سولاخ",
  "جنسی",
  "دوجنسه",
  "سگ تو روحت",
  "بی غیرت",
  "نعشه",
  "بی عفت",
  "مادرقهوه",
  "پلشت",
  "پریود",
  "کله کیری",
  "کیرناز",
  "پشمام",
  "لختی",
  "کسکیر",
  "دوست دختر",
  "دوست پسر",
  "کونشو",
  "دول",
  "شنگول",
  "کیردراز",
  "داف ناز",
  "سکسیم",
  "کوص",
  "ساکونی",
  "کون گنده",
  "سکسی باش",
  "کسخل",
  "صیغه ای",
  "گوش دراز",
  "درازگوش",
  "توله سگ",
  "خز",
  "ماچ",
  "ماچ کردنی",
  "اسکل",
  "هیز",
  "بیناموس",
  "اوسکل",
  "بی آبرو",
  "لاشی",
  "لاش گوشت",
  "باسن",
  "جکس",
  "سگ صفت",
  "کصکش",
  "مشروب",
  "عرق خور",
  "سکس چت",
  "جوون",
  "سرخور",
  "کلفت",
  "حشر",
  "لاس",
  "زارت",
  "رشتیf",
  "ترک",
  "فارس",
  "لر",
  "عرب",
  // "خر",
  "گاو",
  "اسب",
  "گوسفند",
  "کرم",
  "الاق",
  "الاغ",
  "احمق",
  "بی شعور",
  "حرومزاده",
  "کونی",
  "گه",
  "مادر جنده",
  "کث",
  "کص",
  "پسون",
  "خارکسّه",
  "دهن گاییده",
  "دهن سرویس",
  "پدر سگ",
  "پدر سوخته",
  "پدر صلواتی",
  "لامصب",
  "زنیکه",
  "مرتیکه",
  "مردیکه",
  "بی خایه",
  "عوضی",
  "اسگل",
  "اوسکل",
  "اوسگل",
  "اوصگل",
  "اوصکل",
  "دیوث",
  "دیوص",
  "قرمصاق",
  "قرمساق",
  "غرمساق",
  "غرمصاق",
  "فیلم سوپر",
  "چاقال",
  "چاغال",
  "چس خور",
  "کس خور",
  "کس خل",
  "کوس خور",
  "کوس خل",
  "کص لیس",
  "کث لیس",
  "کس لیس",
  "کوص لیس",
  "کوث لیس",
  "کوس لیس",
  "کون سوراخ",
  "سوراخ کون",
  "کون پنیر",
  "سگ دهن",
  "جاکش",
  "گوه",
  "تخم سگ",
  "صیک",
  "گوز باقالي",
  "لاشی",
  "نکبت",
  "عنتر",
  "پفیوز",
  "عن",
  "عن تر",
  "خایه مال",
  "شورتم ماسکت",
  "اسکل",
  "گوزو",
  "اسگول",

  ,
  // "anal",

  "anus",

  "arse",

  // "ass",

  "balls",

  "ballsack",

  "bastard",

  "biatch",

  "bitch",

  "bloody",

  "blow job",

  "blowjob",

  "bollock",

  "bollok",

  "boner",

  "boob",

  "bugger",

  // "bum",

  // "butt",

  "buttplug",

  "clitoris",

  "cock",

  "coon",

  "crap",

  "cunt",

  "damn",

  "dick",

  "dildo",

  "dyke",

  "f u c k",

  // "fag",

  "feck",

  "felching",

  "fellate",

  "fellatio",

  "flange",

  "fuck",

  "fudge packer",

  "fudgepacker",

  "God damn",

  "Goddamn",

  "hell",

  "homo",

  "jerk",

  "jizz",

  "knob end",

  "knobend",

  "labia",

  "lmao",

  "lmfao",

  "muff",

  "nigga",

  "nigger",

  // "omg",

  "penis",

  // "piss",

  "poop",

  "prick",

  "pube",

  "pussy",

  "queer",

  "s hit",

  "scrotum",

  "sex",

  "sh1t",

  "shit",

  "slut",

  "smegma",

  "spunk",

  // "tit",

  "tosser",

  "turd",

  "twat",

  "vagina",

  "wank",

  "whore",

  "wtf",

  "سكس",

  "طيز",

  "شرج",

  "لعق",

  "لحس",

  "مص",

  "تمص",

  "بيضان",

  "ثدي",

  "بز",

  "بزاز",

  "حلمة",

  "مفلقسة",

  "بظر",

  "كس",

  "فرج",

  "شهوة",

  "شاذ",

  "مبادل",

  "عاهرة",

  "جماع",

  "قضيب",

  "زب",

  "لوطي",

  "لواط",

  "سحاق",

  "سحاقية",

  "اغتصاب",

  "خنثي",

  "احتلام",

  "نيك",

  "متناك",

  "متناكة",

  "شرموطة",

  "عرص",

  "خول",

  "قحبة",

  "لبوة",

  "آب کیر",

  "ارگاسم",

  "برهنه",

  "پورن",

  "پورنو",

  "تجاوز",

  "تخمی",

  "جق",

  "جقی",

  "جلق",

  "جنده",

  "چوچول",

  "حشر",

  "حشری",

  "داف",

  "دودول",

  "ساک زدن",

  "سکس",

  "سکس کردن",

  "سکسی",

  "سوپر",

  "شق کردن",

  "شهوت",

  "شهوتی",

  "شونبول",

  "فیلم سوپر",

  // "کس",

  "کس دادن",

  "کس کردن",

  "کسکش",

  "کوس",

  "کون",

  "کون دادن",

  "کون کردن",

  "کونکش",

  "کونی",

  "کیر",

  "کیری",

  "لاپا",

  "لاپایی",

  "لاشی",

  "لخت",

  "لش",

  "منی",

  "هرزه",
  "آب کیر",
  "آشغال",
  "آلت تناسلی",
  "آلت",
  "ابله",
  "ابن یزید",
  "احمق",
  "اسب",
  "اسبی",
  "اسکل",
  "اسکل",
  "اسگل",
  "اسگول",
  "الاغ",
  "الاق",
  "انگل",
  "انی",
  "انی",
  "اوسکل",
  "اوسکل",
  "اوسگل",
  "اوصکل",
  "اوصگل",
  "ب ک",
  "باسن",
  "بخورش",
  "بدبخت",
  "بمال",
  "تخمم",
  "کیرم",
  "بپرروش",
  "بپرسرش",
  "کونی",
  "بکارت",
  "بکن توش",
  "بکنش",
  "بکنمت",
  "خایه",
  "بی عفت",
  "بی غیرت",
  "بی ناموس",
  "بی پدر",
  "بیابخورش",
  "بیشعور",
  "بیناموس",
  "تخم سگ",
  "تخمی",
  "ترک",
  "توله سگ",
  "جاکش",
  "جلق زدن",
  "جنده",
  "جنسی",
  "جوون",
  "جکس",
  "جیندا",
  "حرومزاده",
  "حشر",
  "حشری شدن",
  "حشری",
  "حیوانی",
  "خارکس ده",
  "خارکسده",
  "خارکسّه",
  "خانم جنده",
  "خایه خور",
  "خایه مال",
  "خایه",
  // "خر",
  "خرفت",
  "خری",
  "خز",
  "خفه خون",
  "خفه شو",
  "خواهرجنده",
  "خی کاس",
  "داف ناز",
  "داف",
  "داگ استایل",
  "دخترجنده",
  "دخترقرتی",
  "درازگوش",
  "دله",
  "دهن سرویس",
  "گاییده",
  "دهنت سرویس",
  "دوجنسه",
  "دول",
  "دیوث",
  "دیوس خان",
  "دیوس",
  "دیوص",
  "رشتی",
  "ریدن",
  "ریدی",
  "زارت",
  "زباله",
  "زرنزن",
  "زن جنده",
  "زن کاسده",
  "زنا زاده",
  "زنا",
  "زنازاده",
  "زنتو",
  "زنشو",
  "زنیکه",
  "سادیسمی",
  "ساک",
  "ساکونی",
  "سرخور",
  "سرکیر",
  "سسکی",
  "سوراخ کون",
  "سوراخ کون",
  "سولاخ",
  "سکس چت",
  "سکس",
  "سکسی باش",
  "سکسی",
  "سکسیم",
  "سکسیی",
  "سگ تو روحت",
  "سگ دهن",
  "سگ صفت",
  "سگ پدر",
  "سگی",
  "سیکتیر",
  "شاسگول",
  "شاش",
  "شق کردن",
  "شل مغز",
  "شنگول",
  "شهوتی",
  "صیغه ای",
  "صیک",
  "عرب",
  "عرق خور",
  "عمتو",
  "عمه ننه",
  "عن تر",
  "عن",
  "عنتر",
  "عوضی",
  "غرمساق",
  "غرمصاق",
  "فاحشه خانم",
  "فاحشه",
  "فارس",
  "فاک فیس",
  "فیلم سوپر",
  "قرتی",
  "قرمساق",
  "قرمصاق",
  "قس",
  "لا پا",
  "لاس",
  "لاش گوشت",
  "لاشی",
  "لاکونی",
  "لجن",
  "لخت",
  "لختی",
  // "لر",
  // "لز",
  "مادر جنده",
  "مادرجنده",
  "مادرسگ",
  "مادرقهوه",
  "مادرکونی",
  "مالوندن",
  "ماچ کردنی",
  "مرتیکه",
  "مردیکه",
  "مرض داری",
  "مرضداری",
  "مشروب",
  "ملنگ",
  "ممه خور",
  "ممه",
  "منگل",
  "میخوریش",
  "نرکده",
  "نعشه",
  "نکبت",
  "نگاییدم",
  "هیز",
  "ولدزنا",
  "پدر سوخته",
  "پدر سگ",
  "پدر صلواتی",
  "پدرسگ",
  "پریود",
  "پستان",
  "پسون",
  "پشمام",
  "پفیوز",
  "پلشت",
  "پورن",
  "پپه",
  "چاغال",
  "چاقال",
  "چس خور",
  "چس",
  "کاسکش",
  "کث لیس",
  "کث",
  "کثافت",
  "کثافط",
  "کردن",
  "کردنی",
  "کرم",
  "کس خل",
  "کس خور",
  "کس خیس",
  "کس دادن",
  "کس لیس",
  "کس لیسیدن",
  "کس ننت",
  "کس و کیر",
  "کس کردن",
  "کس کش",
  // "کس",
  "کسخل",
  "کسشعر",
  "کسکش",
  "کسکیر",
  "کص خل",
  "کص لیس",
  "کص",
  "کصافت",
  "کصافط",
  "کصخل",
  "کصکش",
  "کلفت",
  "کله کیری",
  "کوث لیس",
  "کوس خل",
  "کوس خور",
  "کوس لیس",
  "کوس",
  "کوص خل",
  "کوص لیس",
  "کوص",
  "کون تپل",
  "کون ده",
  "کون سوراخ",
  "کون پنیر",
  "کون گنده",
  "کون",
  "کونده خار",
  "کونده خوار",
  "کونده",
  "کونشو",
  "کونی",
  "کونی",
  "کیر",
  "کیردراز",
  "کیردوس",
  "کیرر",
  "کیرمکیدن",
  "کیرناز",
  "کیروکس",
  "کیروکس",
  "کیری",
  "گاو",
  "گاوی",
  "گاگول",
  "گایدن",
  "گایدی",
  "گاییدن",
  "گردن دراز",
  "گشاد",
  "گوز",
  "گوزو",
  "گوسفند",
  "گوش دراز",
  "گوه",
  "گوه",
  "گی زن",
  "گیخوار",
  "یبن زنا",
  "مادرتو",
  "ناموستو",
  "چنده",
  "باسنی",
  "سیکیم",
  "سگ ناموس",
  "نوب",
  "خایمال",
  "مادر به خطا",
  "کصلیس",
  "بکنت",
  "کصده",
  "گورومساخ",
  "پوفیوز",
  "پدرتو",
  "قورومساق",
  "سیهدیر",
  "اوبی",
  "مادر سگ",
  "نگایدم",

  "amcığa",

  "amcığı",

  "amcığın",

  "amcık",

  "amcıklar",

  "amcıklara",

  "amcıklarda",

  "amcıklardan",

  "amcıkları",

  "amcıkların",

  "amcıkta",

  "amcıktan",

  "amı",

  "amlar",

  "çingene",

  "Çingenede",

  "Çingeneden",

  "Çingeneler",

  "Çingenelerde",

  "Çingenelerden",

  "Çingenelere",

  "Çingeneleri",

  "Çingenelerin",

  "Çingenenin",

  "Çingeneye",

  "Çingeneyi",

  "göt",

  "göte",

  "götler",

  "götlerde",

  "götlerden",

  "götlere",

  "götleri",

  "götlerin",

  "götte",

  "götten",

  "götü",

  "götün",

  "götveren",

  "götverende",

  "götverenden",

  "götverene",

  "götvereni",

  "götverenin",

  "götverenler",

  "götverenlerde",

  "götverenlerden",

  "götverenlere",

  "götverenleri",

  "götverenlerin",

  "kaltağa",

  "kaltağı",

  "kaltağın",

  "kaltak",

  "kaltaklar",

  "kaltaklara",

  "kaltaklarda",

  "kaltaklardan",

  "kaltakları",

  "kaltakların",

  "kaltakta",

  "kaltaktan",

  "orospu",

  "orospuda",

  "orospudan",

  "orospular",

  "orospulara",

  "orospularda",

  "orospulardan",

  "orospuları",

  "orospuların",

  "orospunun",

  "orospuya",

  "orospuyu",

  "otuz birci",

  "otuz bircide",

  "otuz birciden",

  "otuz birciler",

  "otuz bircilerde",

  "otuz bircilerden",

  "otuz bircilere",

  "otuz bircileri",

  "otuz bircilerin",

  "otuz bircinin",

  "otuz birciye",

  "otuz birciyi",

  "saksocu",

  "saksocuda",

  "saksocudan",

  "saksocular",

  "saksoculara",

  "saksocularda",

  "saksoculardan",

  "saksocuları",

  "saksocuların",

  "saksocunun",

  "saksocuya",

  "saksocuyu",

  "sıçmak",

  "sik",

  "sike",

  "siker sikmez",

  "siki",

  "sikilir sikilmez",

  "sikin",

  "sikler",

  "siklerde",

  "siklerden",

  "siklere",

  "sikleri",

  "siklerin",

  "sikmek",

  "sikmemek",

  "sikte",

  "sikten",

  "siktir",

  "siktirir siktirmez",

  "taşağa",

  "taşağı",

  "taşağın",

  "taşak",

  "taşaklar",

  "taşaklara",

  "taşaklarda",

  "taşaklardan",

  "taşakları",

  "taşakların",

  "taşakta",

  "taşaktan",

  "yarağa",

  "yarağı",

  "yarağın",

  "yarak",

  "yaraklar",

  "yaraklara",

  "yaraklarda",

  "yaraklardan",

  "yarakları",

  "yarakların",

  "yarakta",

  "yaraktan",

  "دوست دختر",

  "دختربازی",

  "دختر بازی",
  "فساد",

  "دهان",

  "سینه",
  "مرگ",
  "فشفشه",
  "نئشه",
];

const add_word = function (value) {
  const found = badWords.find((e) => e == value);
  if (found == undefined) {
    badWords.push(value);
  }
};

const is_bad = function (value) {
  const found = badWords.find((e) => e == value);

  if (found == undefined) {
    return false;
  }

  return true;
};

const remove_word = function (value) {
  badWords = badWords.filter((e) => e != value);
};

const hasSwear = function (value) {
  for (let index = 0; index < badWords.length; index++) {
    if (value !== null && value !== "") {
      if (value.toLowerCase().includes(badWords[index])) {
        console.log(badWords[index]);
        return true;
      }
    }
  }
  for (let index = 0; index < politicalWords.length; index++) {
    if (value !== null && value !== "") {
      if (value.toLowerCase().includes(politicalWords[index])) {
        console.log(politicalWords[index]);
        return true;
      }
    }
  }
  return false;
};

let politicalWords = [
  "سیاست",

  "رهبری",

  "بیت رهبری",

  "خامنه ای",

  "خامنه",

  "خمینی",
  "امام",

  "سیدعلی",

  "سید علی",

  "روحانی",

  "شیخ",

  "آخوند",

  "khamenei",

  "beyt rahbari",

  "khomeini",

  "siyasat",
  "seyed ali",
  "rahbari",
  "namaz",
];

module.exports = { is_bad, remove_word, add_word, hasSwear };
